Documents/Собеседование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Собеседование</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаУчастиеВСобеседовании</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Укотовитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпекуныУкотовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУчастиеВСобеседовании</v8:Type>
						<v8:Type>cfg:DocumentRef.Собеседование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пройдено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Собеседование/Ext/ManagerModule.bsl
Процедура ПечатьАнкеты(ТабДок, Ссылка) Экспорт
	
	ТабДок.Автомасштаб = Истина;
	
	Макет = Документы.Собеседование.ПолучитьМакет("ПечатьАнкеты");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Собеседование.Дата,
		|	Собеседование.Кошка,
		|	Собеседование.Номер,
		|	Собеседование.Ответственный,
		|	Собеседование.Укотовитель
		|ИЗ
		|	Документ.Собеседование КАК Собеседование
		|ГДЕ
		|	Собеседование.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластиМакета = Макет.Области;
	Вопросы = Макет.ПолучитьОбласть("Вопросы");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень()); 
		
		ТабДок.Вывести(Вопросы);
		
		//Для Индекс = 0 По ОбластиМакета.Количество() - 1 Цикл
		//	
		//	ТекОбласть = ОбластиМакета[Индекс];
		//	ВыводимаяОбласть = Макет.ПолучитьОбласть(ТекОбласть.Имя);
		//	Если ТекОбласть.Имя <> "Шапка" Тогда
		//		ТабДок.Вывести(ВыводимаяОбласть);
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
